Repository: QAQ998/AwakeMac
Catalog: AwakeMac/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.description
source: Keeps your Mac awake without changing its original idle-sleep settings.
zh_hans: 在不修改 Mac 原有空闲睡眠设置的前提下保持唤醒。

# about.version
source: Version 1.2.2 (13)
zh_hans: 版本 1.2.2 (13)

# common.apply
source: Apply
zh_hans: 应用

# common.cancel
source: Cancel
zh_hans: 取消

# common.ok
source: OK
zh_hans: 好

# common.supported
source: Supported
zh_hans: 支持

# common.unavailable
source: Unavailable
zh_hans: 不可用

# duration.custom
source: Custom duration
zh_hans: 自定义时长

# duration.custom.detail
source: Enter a value from 1 minute to 24 hours.
zh_hans: 请输入 1 分钟到 24 小时之间的时长。

# duration.custom.title
source: Custom Duration
zh_hans: 自定义时长

# duration.detail
source: Changing it restarts the countdown
zh_hans: 修改后将重新开始倒计时

# duration.hours
source: %d hr
zh_hans: %d 小时

# duration.hoursMinutes
source: %d hr %d min
zh_hans: %d 小时 %d 分钟

# duration.minutes
source: %d min
zh_hans: %d 分钟

# duration.title
source: Duration
zh_hans: 持续时间

# duration.unlimited
source: Unlimited
zh_hans: 无限期

# error.title
source: AwakeMac Couldn’t Complete the Action
zh_hans: 醒着无法完成操作

# helper.enabled
source: Installed locally
zh_hans: 已安装到本机

# helper.install
source: Install Helper…
zh_hans: 安装助手…

# helper.installFailed
source: The local helper could not be installed.
zh_hans: 无法安装本机合盖助手。

# helper.installing
source: Installing…
zh_hans: 正在安装…

# helper.notFound
source: Not found
zh_hans: 未找到

# helper.notInstalled
source: Not installed
zh_hans: 未安装

# helper.reinstall
source: Reinstall Helper…
zh_hans: 重新安装助手…

# helper.remove.action
source: Remove Helper…
zh_hans: 卸载助手…

# helper.remove.body
source: This restores lid sleep and removes AwakeMac’s root helper from this Mac. Administrator authorization is required.
zh_hans: 这会恢复合盖睡眠，并从本机移除醒着的 root 助手。操作需要管理员授权。

# helper.remove.title
source: Remove the Local Helper?
zh_hans: 卸载本机助手？

# helper.requiresApproval
source: Approval required
zh_hans: 需要批准

# helper.update
source: Update Helper…
zh_hans: 更新助手…

# helper.updateRequired
source: Update required
zh_hans: 需要更新

# helper.unknown
source: Unknown
zh_hans: 未知

# lid.active
source: Closed-lid mode is on
zh_hans: 合盖模式已开启

# lid.alert.body
source: Running with the lid closed may generate heat and use battery. AwakeMac restores lid sleep below 20% battery, under serious thermal pressure, or if its safety lease expires.
zh_hans: 合盖后持续运行可能产生热量并消耗电池。电量低于 20%、温度过高或安全租约失效时，醒着会恢复合盖睡眠。

# lid.alert.continue
source: Continue and Install Helper…
zh_hans: 继续并安装助手…

# lid.alert.enable
source: Continue
zh_hans: 继续

# lid.alert.title
source: Enable Experimental Lid Mode?
zh_hans: 启用实验性合盖模式？

# lid.approvalRequired
source: Approve the helper in System Settings
zh_hans: 请在系统设置中批准助手

# lid.enableWakeFirst
source: Turn on Stay Awake first
zh_hans: 请先开启保持唤醒

# lid.experimental
source: Experimental; restores lid sleep after 90 seconds without contact
zh_hans: 实验功能，应用失联 90 秒后自动恢复合盖睡眠

# lid.installing
source: Installing the local helper…
zh_hans: 正在安装本机助手…

# login.approvalRequired
source: Allow AwakeMac in Login Items & Extensions, then try again.
zh_hans: 请在“登录项与扩展”中允许 AwakeMac，然后重试。

# lid.installRequired
source: Local helper installation is required
zh_hans: 需要安装本机助手

# lid.title
source: Stay awake with lid closed
zh_hans: 合盖仍保持运行

# lid.unavailable
source: This Mac has no lid sleep feature
zh_hans: 此 Mac 没有合盖睡眠功能

# lid.updateRequired
source: The local helper needs an update
zh_hans: 本机助手需要更新

# notification.battery.body
source: Lid sleep was restored because battery reached 20%.
zh_hans: 电量已降至 20%，合盖睡眠已恢复。

# notification.safety.title
source: Lid Sleep Restored
zh_hans: 已恢复合盖睡眠

# notification.thermal.body
source: Lid sleep was restored because the Mac is under thermal pressure.
zh_hans: Mac 温度压力过高，合盖睡眠已恢复。

# notification.timer.body
source: The wake timer ended and original sleep behavior is active again.
zh_hans: 保持唤醒计时已结束，Mac 已恢复原有睡眠行为。

# notification.timer.title
source: Wake Session Ended
zh_hans: 保持唤醒已结束

# quit.stop
source: Stop and Quit
zh_hans: 关闭并退出

# remaining.hoursMinutes
source: %d hr %d min remaining
zh_hans: 剩余 %d 小时 %d 分钟

# remaining.minutes
source: %d min remaining
zh_hans: 剩余 %d 分钟

# remaining.seconds
source: %d sec remaining
zh_hans: 剩余 %d 秒

# safety.active
source: Lid sleep returns automatically on low battery, high temperature, or lease expiry.
zh_hans: 低电量、温度过高或租约失效时会自动恢复合盖睡眠。

# safety.approval
source: Install the local helper with administrator authorization, then try again.
zh_hans: 请使用管理员授权安装本机助手，然后重试。

# safety.helperUnavailable
source: The lid helper is unavailable; normal wake mode still works.
zh_hans: 合盖助手不可用，普通保持唤醒仍可使用。

# safety.lowBattery
source: Lid sleep was restored at 20% battery.
zh_hans: 电量达到 20%，已恢复合盖睡眠。

# safety.thermal
source: Lid sleep was restored because of thermal pressure.
zh_hans: 温度压力过高，已恢复合盖睡眠。

# settings.about
source: About
zh_hans: 关于

# settings.alwaysOn
source: Always on
zh_hans: 始终开启

# settings.batteryGuard
source: Low-battery cutoff
zh_hans: 低电量保护

# settings.defaultDuration
source: Default duration
zh_hans: 默认持续时间

# settings.experimentalNotice
source: Closed-lid mode relies on a system capability that Apple does not publicly guarantee. The app renews its permission every 30 seconds; if contact is lost for 90 seconds, the helper restores normal lid sleep automatically. Battery and thermal protections can’t be disabled.
zh_hans: 合盖模式依赖 Apple 未公开承诺兼容性的系统能力。应用每 30 秒续约一次；连续 90 秒失联后，助手会自动恢复正常的合盖睡眠。电量和温度保护不可关闭。

# settings.general
source: General
zh_hans: 通用

# settings.hardware
source: Hardware
zh_hans: 硬件

# settings.helper
source: Lid helper
zh_hans: 合盖助手

# settings.language
source: App language
zh_hans: 应用语言

# settings.launchAtLogin
source: Launch at login
zh_hans: 登录时启动

# settings.lidCapability
source: Lid capability
zh_hans: 合盖能力

# settings.model
source: Model
zh_hans: 机型

# settings.open
source: Settings…
zh_hans: 设置…

# settings.protection
source: Protection
zh_hans: 安全保护

# settings.safety
source: Safety
zh_hans: 安全

# settings.thermalGuard
source: Thermal protection
zh_hans: 温度保护

# status.off
source: Off — using system settings
zh_hans: 已关闭，使用系统设置

# unit.minutes
source: minutes
zh_hans: 分钟

# wake.title
source: Stay Awake
zh_hans: 保持唤醒

# wake.toggle.hint
source: Prevents idle display and system sleep.
zh_hans: 阻止因空闲而息屏和整机睡眠。

# settings.automation
source: Automation
zh_hans: 自动化

# automation.section
source: App Link
zh_hans: App 联动

# automation.enable
source: Keep awake with selected app
zh_hans: 跟随指定 App 保持唤醒

# automation.targetApp
source: Selected app
zh_hans: 指定 App

# automation.noApp
source: Not selected
zh_hans: 尚未选择

# automation.chooseApp
source: Choose…
zh_hans: 选择…

# automation.choosePanelTitle
source: Choose an App to Follow
zh_hans: 选择要联动的 App

# automation.choose
source: Choose
zh_hans: 选择

# automation.exitGrace
source: Stop after app quits
zh_hans: App 退出后关闭

# automation.grace.immediately
source: Immediately
zh_hans: 立即

# automation.detail
source: The normal wake mode starts with the selected app. Reopening it during the grace period cancels shutdown.
zh_hans: 指定 App 运行时自动开启普通唤醒；缓冲期内重新打开会取消关闭。

# automation.invalidApp
source: The selected item is not a valid macOS app.
zh_hans: 所选项目不是有效的 macOS App。

# automation.chooseFirst
source: Choose an app before enabling App Link.
zh_hans: 请先选择一个 App，再开启联动。

# automation.active
source: Kept awake by %@
zh_hans: 正在跟随 %@ 保持唤醒

# automation.exitCountdown
source: %@ quit · stopping in %d:%02d
zh_hans: %@ 已退出，%d:%02d 后关闭

# automation.notificationTitle
source: App Link Ended
zh_hans: App 联动已结束

# automation.notificationBody
source: The selected app stayed closed, so original sleep behavior is active again.
zh_hans: 指定 App 已持续退出，Mac 已恢复原有睡眠行为。

# quickAway.settings.section
source: Quick Break
zh_hans: 暂离功能

# quickAway.settings.introduction
source: When you step away briefly, AwakeMac keeps the computer awake for the selected duration and lowers supported displays to the chosen brightness. It asks for confirmation before starting and restores brightness when the session ends.
zh_hans: 短暂离开时，醒着会在设定时间内保持电脑唤醒，并把支持的显示器调到所选亮度；每次开启前都会二次确认，结束后自动恢复原亮度。

# quickAway.settings.copyStyle
source: Copy style
zh_hans: 文案风格

# quickAway.style.aquatic
source: Field Research
zh_hans: 水产调研

# quickAway.style.cyber
source: Cyber Cover
zh_hans: 赛博托管

# quickAway.settings.duration
source: Duration
zh_hans: 托管时长

# quickAway.settings.brightness
source: Brightness
zh_hans: 亮度档位

# quickAway.settings.detail
source: Starting this always asks for confirmation and replaces the current wake session. Brightness is restored when it ends.
zh_hans: 每次开启都需要确认，并会替换当前唤醒会话；结束后自动恢复亮度。

# quickAway.open
source: Start
zh_hans: 开始

# quickAway.defaultDetail
source: %d min · brightness %d/64
zh_hans: 低亮度保持唤醒 %d 分钟 · %d/64

# quickAway.activeRemaining
source: %@ · %d min left
zh_hans: %@ · 剩余 %d 分钟

# quickAway.replacesSession
source: The current wake session will be replaced and lid mode will safely turn off.
zh_hans: 当前唤醒会话将被替换，合盖模式也会安全退出。

# quickAway.noAdjustableDisplay
source: No adjustable display was detected. Wake mode will still start without changing brightness.
zh_hans: 未检测到可调亮度的显示器；仍会保持唤醒，但不会调整亮度。

# quickAway.restoreFailed
source: Some display brightness levels could not be restored. Please adjust them manually.
zh_hans: 部分显示器亮度未能恢复，请手动接管一下。

# quickAway.aquatic.start
source: Start Field Research
zh_hans: 开始水产调研

# quickAway.aquatic.active
source: Research in progress
zh_hans: 调研中

# quickAway.aquatic.return
source: Back to Work
zh_hans: 收网回岗

# quickAway.aquatic.confirmTitle
source: Ready to dive in?
zh_hans: 确定要下水吗？

# quickAway.aquatic.confirmBody
source: For the next %d minutes, AwakeMac will keep watch and lower display brightness to %d/64.
zh_hans: 接下来 %d 分钟，醒着会替你守好工位，并把屏幕亮度降至 %d/64。

# quickAway.aquatic.confirm
source: Dive In
zh_hans: 下水调研

# quickAway.aquatic.cancel
source: Stay Ashore
zh_hans: 留在岸上

# quickAway.aquatic.notificationTitle
source: Field Research Complete
zh_hans: 水产调研已结束

# quickAway.aquatic.notificationBody
source: The nets are in. Brightness and normal sleep behavior have been restored.
zh_hans: 已经收网，屏幕亮度与原有睡眠行为均已恢复。

# quickAway.cyber.start
source: Let Me Cover Your Shift
zh_hans: 让本帅替会儿班

# quickAway.cyber.active
source: I’m covering your shift
zh_hans: 本帅正在替你值班

# quickAway.cyber.return
source: I’m Back
zh_hans: 我回来接班了

# quickAway.cyber.confirmTitle
source: Hand the desk over to me?
zh_hans: 把工位交给本帅？

# quickAway.cyber.confirmBody
source: For the next %d minutes, I’ll stay awake and lower display brightness to %d/64.
zh_hans: 接下来 %d 分钟，本帅会保持清醒，并把屏幕亮度降至 %d/64。

# quickAway.cyber.confirm
source: You’ve Got This
zh_hans: 放心交班

# quickAway.cyber.cancel
source: Not Yet
zh_hans: 我再等等

# quickAway.cyber.notificationTitle
source: My Shift Is Over
zh_hans: 本帅下班了

# quickAway.cyber.notificationBody
source: Shift complete. Brightness and normal sleep behavior have been restored.
zh_hans: 本帅已完成本次值班，亮度与原有睡眠行为均已恢复。

# widget.lid.active
source: Lid mode on
zh_hans: 合盖模式已开启

# widget.lid.noLid
source: No lid
zh_hans: 无合盖功能

# widget.lid.off
source: Advanced mode off
zh_hans: 高级模式未开启

# widget.name
source: Awake
zh_hans: 醒着

# widget.start
source: Start
zh_hans: 开启

# widget.stop
source: Stop
zh_hans: 关闭

# widget.systemSettings
source: Using system settings
zh_hans: 使用系统设置
